IDENTIFICATION DIVISION.
PROGRAM-ID. TEST-VARIABLES.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-COD-EMPRESA PIC X(4).
01 S21-AREA-ENTORNO.
   05 COD-EMPRESA PIC X(4).

PROCEDURE DIVISION.
MAIN-PROCESS.
    MOVE COD-EMPRESA OF S21-AREA-ENTORNO TO WS-COD-EMPRESA
    STOP RUN.
