       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULADORA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERO1        PIC 9(5).
       01  NUMERO2        PIC 9(5).
       01  RESULTADO      PIC 9(6).
       01  OPERACION      PIC X(1).
       01  MENSAJE        PIC X(30).
       PROCEDURE DIVISION.
           MOVE 100 TO NUMERO1.
           MOVE 50 TO NUMERO2.
           MOVE '+' TO OPERACION.
           ADD NUMERO1 TO NUMERO2 GIVING RESULTADO.
           MOVE 'SUMA COMPLETADA' TO MENSAJE.
           DISPLAY MENSAJE.
           DISPLAY 'RESULTADO: ' RESULTADO.
           STOP RUN.
