       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMADEMO.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       1400-ARMA-REC-T08CT176.
           IF VARIABLE1 = 'AB' THEN
		      DISPLAY VARIABLE1
           ELSE
		      DISPLAY VARIABLE2
		   END-IF.

 
           IF COD-TIP-ORIENTACION OF MSG-IN EQUAL 'CC' OR
              COD-TIP-ORIENTACION OF MSG-IN EQUAL 'RT' THEN
             
			 MOVE 'CTB1' TO FOR-PAGO    OF T08CT176
			 MOVE 'CTB2' TO FOR-PAGO    OF T08CT176
			 MOVE 'CTB3' TO FOR-PAGO    OF T08CT176
			 MOVE 'CTB4' TO FOR-PAGO    OF T08CT176
			 MOVE 'CTB5' TO FOR-PAGO    OF T08CT176
             DISPLAY COD-TIP-ORIENTACION
           ELSE
               MOVE 'CC6' TO IND-TIP-CONTA      OF T08CT176
			   MOVE 'CC7' TO IND-TIP-CONTA      OF T08CT176
			   MOVE 'CC8' TO IND-TIP-CONTA      OF T08CT176
			   MOVE 'CC9' TO IND-TIP-CONTA      OF T08CT176
               IF COD-TIP-ORIENTACION OF MSG-IN EQUAL 'CC' OR
                  COD-TIP-ORIENTACION OF MSG-IN EQUAL 'RT' THEN
             
			     MOVE 'CTB10' TO FOR-PAGO    OF T08CT176
				 MOVE 'CTB11' TO FOR-PAGO    OF T08CT176
				 MOVE 'CTB12' TO FOR-PAGO    OF T08CT176
				 MOVE 'CTB13' TO FOR-PAGO    OF T08CT176
                 DISPLAY COD-TIP-ORIENTACION
               ELSE
                   MOVE 'CC14' TO IND-TIP-CONTA      OF T08CT176
                   IF COD-TIP-ORIENTACION OF MSG-IN EQUAL 'CC' OR
                      COD-TIP-ORIENTACION OF MSG-IN EQUAL 'RT' THEN
                 
			         MOVE 'CTB15' TO FOR-PAGO    OF T08CT176
					 MOVE 'CTB16' TO FOR-PAGO    OF T08CT176
					 MOVE 'CTB17' TO FOR-PAGO    OF T08CT176
					 MOVE 'CTB18' TO FOR-PAGO    OF T08CT176
                     DISPLAY COD-TIP-ORIENTACION
                   ELSE
                       MOVE 'CC19' TO IND-TIP-CONTA      OF T08CT176
                       IF COD-TIP-ORIENTACION OF MSG-IN EQUAL 'CC' OR
                          COD-TIP-ORIENTACION OF MSG-IN EQUAL 'RT' THEN
                     
			             MOVE 'CTB20' TO FOR-PAGO    OF T08CT176
						 MOVE 'CTB21' TO FOR-PAGO    OF T08CT176
						 MOVE 'CTB22' TO FOR-PAGO    OF T08CT176
						 MOVE 'CTB23' TO FOR-PAGO    OF T08CT176
						 
                         DISPLAY COD-TIP-ORIENTACION
                       ELSE
                           MOVE 'CC24' TO IND-TIP-CONTA      OF T08CT176
						   MOVE 'CC25' TO IND-TIP-CONTA      OF T08CT176
						   MOVE 'CC26' TO IND-TIP-CONTA      OF T08CT176
						   MOVE 'CC27' TO IND-TIP-CONTA      OF T08CT176
						   MOVE 'CC28' TO IND-TIP-CONTA      OF T08CT176
        
                       END-IF     
                   END-IF    
               END-IF
           END-IF.
