IDENTIFICATION DIVISION.
PROGRAM-ID. SIMPLE-FILE-TEST.

PROCEDURE DIVISION.
MAIN-PROCESS.
    OPEN INPUT ARCHIVO-ENTRADA
    READ ARCHIVO-ENTRADA
        AT END DISPLAY 'Fin de archivo'
        NOT AT END DISPLAY 'Registro leido'
    END-READ
    CLOSE ARCHIVO-ENTRADA
    STOP RUN.
